src/exchangeXML/getRoot.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:t="https://schemas.microsoft.com/exchange/services/2006/types">
    <soap:Body>
        <GetFolder xmlns="https://schemas.microsoft.com/exchange/services/2006/messages"
            xmlns:t="https://schemas.microsoft.com/exchange/services/2006/types">
            <FolderShape>
                <t:BaseShape>Default</t:BaseShape>
            </FolderShape>
            <FolderIds>
                <t:DistinguishedFolderId Id="inbox" />
            </FolderIds>
        </GetFolder>
    </soap:Body>
</soap:Envelope>